ninetyninecats/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "black"], ["updated_at", "2019-02-26 22:01:45.514602"], ["id", 1]]